#include <iostream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ukr");
    cout << "Теплий лiтнiй вечiр. Ви разом iз своїми друзями вiдпочиваєте\
    в горах. Ви вирiшуєте вiдiйти вiд табору й прогулятися по мiсцевостi." << endl;
    cout << "Куди вирiшите пiти: " << endl;
    cout << "1 - До гiрського озера" << endl;
    cout << "2 - Пiднятися трохи вище, щоб подивитися на природу з висоти" << endl;

    short int action;
    cin >> action;

    switch (action){
        // Перший головний case
    case 1: cout << "Ви пiшли до великого живописного озера, що простяглося вздовж усiєї гiрської долини.\
    Стомленi пiсля спекотного дня, Ви вирiшуєте присiсти поблизу поваленого вiд вiтру дерева.\
    Через кiлька секунд пiсля розположення на деревi, Ви вiдчули рiзкий бiль в лiвiй руцi\
    поблизу зап'ястка. Подивившись на руку ви замiтили отруйного павука-осу (Аргiопа брюннiга)." << endl;
    cout << "Яка Ваша реакцiя: " << endl;
    cout << "1 - Зробити джгут, скориставшись ременем вiд штанiв" << endl;
    cout << "2 - Припалити рану запальничкою" << endl;
    short int antiSpider;
    cin >> antiSpider;



    switch (antiSpider){
    case 1: cout << "Ви зробили джгут i зi спадаючими штанами побiгли до табору.\
    Пiсля прибуття в табiр, Ви все розказали i Вам запропонували: " << endl;
    cout << "1 - Випити таблеку для антиалергiчної реакцiї, пити багато води, знерухомити руку\
    i залишатися в таборi" << endl;
    cout << "2 - Випити таблеку для антиалергiчної реакцiї, пити багато води, знерухомити руку\
    i поїхати до найближчого медпункту" << endl;


     short int antiSpider_2;
     cin >> antiSpider_2;
     switch (antiSpider_2){
         case 1: cout << "Ви вирiшили скористатися медичними засобами й залишитися в таборi.\
         У Вас була невелика головна бiль i почервонiння бiля мiсця укусу.\
         До ранку все пройшло, тому Ви продовжили свiй вiдпочинок будучи набагато уважнiшим\
         i обережнiшим"; break;
         case 2: cout << "Ви вiдправилися донайближчого медичного пунктую. Вам надали допомогу\
         i сказали, що Ви i Вашi друзi надали правильну домедичну допомогу.\
         Потiм Ви повернулися до табору й продовжили свiй вiдпочинок."; break;
          }; return 0;

    case 2: cout << "Ви припалили рану i пiшли до табору.\
    Вашi друзi здивувалися вашiй сокiйнiй поведiнцi, але всеодно запропонували: " << endl;
     cout << "1 - Випити таблеку для антиалергiчної реакцiї, пити багато води, знерухомити руку\
    i залишатися в таборi" << endl;
    cout << "2 - Випити таблеку для антиалергiчної реакцiї, пити багато води, знерухомити руку\
    i поїхати до найближчого медпункту" << endl;

    short int antiSpider_2_2;
    cin >> antiSpider_2_2;
    switch (antiSpider_2_2){
    case 1: cout << "Ви вирiшили скористатися медичними засобами й залишитися в таборi.\
    Через запiзнену реакцiю у Вас болiла голова й була тошнота впродовж двох днiв. Ви вижили."; break;
    case 2: cout << "Ви вiдправилися донайближчого медичного пунктую. Вам надали допомогу\
    i сказали, що Ви повиннi більше знати iнформацiї про те як поводитись в небезпечних ситуацiях."; break;

    }; return 0;


  }
    // Другий головний case
    case 2: cout << "Ви вiдправилися вище в гору по однiй iз стежок.\
    Вийшовши на одну iз полян, Ви побачили гарний краєвид який простягнувся аж до горизонту.\
    Раптом Ви почули сильне ричання позаду себе. Обернувшись, Ви побачили ведмедя." << endl;
    cout << "Для того щоб врятуватися вiд ведмедя Ви вирiшите: " << endl;
    cout << "1 - Прикинутися мертвим" << endl;
    cout << "2 - Залiзти на найближче дерево" << endl;
    cout << "3 - Скористатися досвiдом" << endl;

    short int escapeBear;
    cin >> escapeBear;
    switch(escapeBear)
    {
        case 1: cout << "Ви повiльно лягли на землю вниз обличчям.\
        Ведмiдь пiдiйшов до Вас i став обнюхувати. Ви чули його дихання, як його\
        нiс торкається Вашої кофти. Обнюхавши, ведмiдь пiшов в своєму напрямку.\
        Ви повiльно пiднялися, обдивилися й рушили до табору."; break;
        case 2: cout << "Повiльно пiдiйшовши до найближчого дерева\
        Ви стали швидко на нього залазити. Ведмiдь побiг до Вас. На щастя\
        Ви встигли залiзти достатньо високо. Походивши кiлька хвилин бiля дерева,\
        ведмiдь розвернувся й пiшов."; break;
        case 3: cout << "Ви були досвiдченою людиною i добре розбиралися як в\
        людях так i в тваринах. Ви пiдняли iз землi опале листя i зробили вид, нiби\
        роздаєте рекламнi листiвки. Ведмiдь, побачивши це, зробив вигляд, що Вас не замiтив\
        i пройшов мимо."; break;
        default : cout << "Його охопила панiка, тому вiн став тiкати...\
        Він думав, що я повiльний...От наївний. Ех, треба вертатися до берлоги."; break;
    }
        // Головний default
        default: cout << "Ви вирiшили залишитися в таборi... i, це було чудове рiшення.\
        Ви всi жартували i розповiдали цiкавi iсторiї, грали на гiтарi, насолоджувалися\
        ароматом жареного м\'яса, любувалися краєвидами.";


    }

    return 0;
}
